OdDAI.Anchor.getTypedValue(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the OdAnsiString value of the Anchor instance.
\param valueToGet [out] A placeholder for the requested value.
\returns true if the anchor value was successfully converted to the OdAnsiString data type; otherwise, the method returns false.

OdDAI.Anchor.setTypedValue(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new OdAnsiString value for the Anchor instance.
\param newValue [in] An OdAnsiString value to be set.

OdDAI.Anchor.getTypedValue(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the double value of the Anchor instance.
\param valueToGet [out] A placeholder for the requested value.
\returns true if the anchor value was successfully converted to the double data type; otherwise, the method returns false.

OdDAI.Anchor.setTypedValue(System.Double)
\details
Sets a new double value for the Anchor instance.
\param newValue [in] A double value to be set.

OdDAI.Anchor.getTypedValue(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the integer value of the Anchor instance.
\param valueToGet [out] A placeholder for the requested value.
\returns true if the anchor value was successfully converted to the integer data type; otherwise, the method returns false.

OdDAI.Anchor.setTypedValue(System.Int32)
\details
Sets a new integer value for the Anchor instance.
\param newValue [in] An integer value to be set.

OdDAI.Anchor
\details
The class that implements working with anchor objects.